Revit 2016 API
FabricationPart Properties
The FabricationPart type exposes the following members.
Properties
Name | Description
AssemblyInstanceId
 The id of the assembly instance to which the element belongs.
 (Inherited from Element.)
BoundingBox
Retrieves a box that circumscribes all geometry of the element.
 (Inherited from Element.)
Category
Retrieves a Category object that represents the category or sub category in which the element resides.
 (Inherited from Element.)
ConnectorManager
 The connector manager of the fabrication part.
CreatedPhaseId
 Id of a Phase at which the Element was created.
 (Inherited from Element.)
DemolishedPhaseId
 Id of a Phase at which the Element was demolished.
 (Inherited from Element.)
DesignOption
Returns the design option to which the element belongs.
 (Inherited from Element.)
Document
Returns the Document in which the Element resides.
 (Inherited from Element.)
DomainType
 The domain type for the fabrication part.
Geometry
Retrieves the geometric representation of the element.
 (Inherited from Element.)
GroupId
 The id of the group to which an element belongs.
 (Inherited from Element.)
Id
 A unique identifier for an Element in an Autodesk Revit project.
 (Inherited from Element.)
InsulationSpecification
 The fabrication part insulation specification identifier.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Element.)
LevelId
 The id of the level associated with the element.
 (Inherited from Element.)
LevelOffset
 The associated level offset that indicates the distance from the center of the fabrication part to the current level.
Location
This property is used to find the physical location of an element within a project.
 (Inherited from Element.)
Material
 The fabrication material identifier.
Name
A human readable name for the Element.
 (Inherited from Element.)
Origin
 The origin of the fabrication part element.
OwnerViewId
 The id of the view that owns the element.
 (Inherited from Element.)
Parameter[Guid]
Retrieves a parameter from the element given a GUID for a shared parameter.
 (Inherited from Element.)
Parameter[BuiltInParameter]
Retrieves a parameter from the element given a parameter id.
 (Inherited from Element.)
Parameter[Definition]
Retrieves a parameter from the element based on its definition.
 (Inherited from Element.)
Parameters
Retrieves a set containing all of the parameters that are contained within the element.
 (Inherited from Element.)
ParametersMap
Retrieves a map containing all of the parameters that are contained within the element.
 (Inherited from Element.)
Pinned
 Identifies if the element has been pinned to prevent changes.
 (Inherited from Element.)
ProductCode
 The current database id of the part within the fabrication database.
ProductListEntry
 The product list entry index of the fabrication part. A value of -1 indicates the fabrication part is not a product list entry.
ServiceId
 The fabrication part service identifier.
Specification
 The fabrication part specification identifier.
UniqueId
 A stable unique identifier for an element within the document.
 (Inherited from Element.)
ValidationStatus
 The validation status of the fabrication part.
ViewSpecific
 Identifies if the element is owned by a view.
 (Inherited from Element.)
WorksetId
 Get Id of the Workset which owns the element.
 (Inherited from Element.)
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace